WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetAnyUri_Client_Request-10.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetAnyUri</a:Action>
    <a:MessageID>urn:uuid:3111be69-c591-4974-b509-d95e0705b1e5</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetAnyUri xmlns="http://tempuri.org/">
      <inUri>http://[FEDC:BA98:7654:3210:FEDC:BA98:7654:3210]:8000/index.html</inUri>
    </RetAnyUri>
  </s:Body>
</s:Envelope>